---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Toposolid
source: html/c7164ef8-685c-cc6e-7abb-3ab539284bf8.htm
---
# Toposolid Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.